In [72]:
# Name : Ishwer Kumar Yadav

In [71]:
### Q1 : Create A Series Using Dict In Pandas.

In [4]:
import pandas as pd

a = [1,2,3,4,5,6]
myvar = pd.Series(a)
print(myvar)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [7]:
# Q2 : How To Create A Copy Of The Series In Pandas?

In [10]:
import pandas as pd
import numpy as np

a = pd.Series([2,3], index=['p','q'])
a_copy = a.copy()
a_copy

p    2
q    3
dtype: int64

In [11]:
# Q3 : Create a DataFrame using List

In [21]:
import pandas as pd
data = {
    "Numbers":[1,2,3,4,5],
    "Name":['Danny','Rose','Mandu','Sanju','komal'],
    "City":['Neples','london','Uganda','New Delhi','Kolkata'],
    "Profession":['Artist','singer','Manager','Engineer','Painter']
}
df = pd.DataFrame(data)
print(df)

   Numbers   Name       City Profession
0        1  Danny     Neples     Artist
1        2   Rose     london     singer
2        3  Mandu     Uganda    Manager
3        4  Sanju  New Delhi   Engineer
4        5  komal    Kolkata    Painter

In [22]:
# Q4 : What Are The Different Ways A DataFrame Can Be Created In pandas?
# There are various ways to create into DataFrame using pandas given below-
# 1. Creating pandas Dataframe using list.
# 2. Creating pandas DataFrame from Dist.
# 3. Creating Pandas DataFrame with Index.
# 4. Creating Pandas DataFrame from list of dicts object
# 5. Creating DataFrame from series
# 6. Creating DataFrame using Zip() functions

In [23]:
# 1. Creating pandas Dataframe using list.
import pandas as pd
tech = [['Spark',2000, '10days'],
        ['Pandas',2500, '15days'],
        ]
df = pd.DataFrame(tech)
print(df)

        0     1       2
0   Spark  2000  10days
1  Pandas  2500  15days

In [25]:
# Adding Column & Row labels to the DataFrame
columns_name=['Courses','Fee','Duration']
row_label = ['a','b']
df = pd.DataFrame(tech,columns=columns_name,index=row_label)
print(df)

  Courses   Fee Duration
a   Spark  2000   10days
b  Pandas  2500   15days

In [27]:
# 2. Creating pandas DataFrame from Dist
import pandas as pd
tech = {
    'Courses':['Spark','Pandas'],
    'Fee':[2000,2500],
    'Duration':['3 weeks','5 weeks']
}
df = pd.DataFrame(tech)
print(df)

  Courses   Fee Duration
0   Spark  2000  3 weeks
1  Pandas  2500  5 weeks

In [28]:
# 3. Creating Pandas DataFrame with Index.
tech = {
    'courses':['Sparl','Pandas'],
    'Fee':['2000','2500'],
    'duration':['4weeks','5weeks']
}
index_label = ['r1','r2']
df = pd.DataFrame(tech, index = index_label)
print(df)

   courses   Fee duration
r1   Sparl  2000   4weeks
r2  Pandas  2500   5weeks

In [29]:
# 4. Creating Pandas DataFrame from list of dicts object
tech = [{'Courses':'Spark','Fee' : 20000,'Duration': '4weeks'},
        {'Courses':'Pandas','Fee': 25000, 'Duration': '5weeks'}]
df = pd.DataFrame(tech)
print(df)

  Courses    Fee Duration
0   Spark  20000   4weeks
1  Pandas  25000   5weeks

In [32]:
# 5. Creating DataFrame from series
courses = pd.DataFrame(['Spark','pandas'])
fees = pd.Series([2000,2500])
duration = pd.Series(['4weeks','5weeks'])

df=pd.concat([courses,fees,duration],axis=1)
print(df)

        0     0       1
0   Spark  2000  4weeks
1  pandas  2500  5weeks

In [34]:
# 6. Creating DataFrame using Zip() functions
# create lists
Courses = ['Spark','Panas']
Fee = [20000,25000]
Duration = ['30days','40days']

#merge lists by using zip()
tuples_list = list(zip(Courses, Fee, Duration))
df = pd.DataFrame(tuples_list, columns = ['Courses','Fee', 'Duration'])
print(df)

  Courses    Fee Duration
0   Spark  20000   30days
1   Panas  25000   40days

In [35]:
# Q5 : Write a Pandas program to join the two given dataframes along rows

In [46]:
import pandas as pd
student_data1 = pd.DataFrame({'student_id':['s1','s2','s3','s4'],
              'name':['Dinesh','Mahesh','Suresh','kamlesh'],
             'marks':[130,235,324,250]})
student_data2 = pd.DataFrame({'student_id':['s3','s4','s5','s6'],
              'name':['Sulekha','sunetra','Priyanka','beauty'],
              'marks':[201,200,198,222]})
print("Original DataFrames")
print(student_data1)
print("------------------------------")
print(student_data2)
print("\nJoin the said two dataframes along rows:")
print("---------------------------------------------")


result_data = pd.concat([student_data1,student_data2])
print(result_data)

Original DataFrames
  student_id     name  marks
0         s1   Dinesh    130
1         s2   Mahesh    235
2         s3   Suresh    324
3         s4  kamlesh    250
------------------------------
  student_id      name  marks
0         s3   Sulekha    201
1         s4   sunetra    200
2         s5  Priyanka    198
3         s6    beauty    222

Join the said two dataframes along rows:
---------------------------------------------
  student_id      name  marks
0         s1    Dinesh    130
1         s2    Mahesh    235
2         s3    Suresh    324
3         s4   kamlesh    250
0         s3   Sulekha    201
1         s4   sunetra    200
2         s5  Priyanka    198
3         s6    beauty    222

In [47]:
# Q6 :  Write a pandas program to create a pivot table

In [48]:
import pandas as pd

df = pd.DataFrame({'products':['Carrots','Broccoli','Banana','Beans', 'Orange','Broccoli','Banana'],
                   'Category':['vegetables','vegetables','fruits','vegetables','fruits','vegetables','fruits'],
                   'Quantity':[8,5,3,4,5,9,11],
                   'Amount':[270,239,617,384,626,610,62]})
df

   products    Category  Quantity  Amount
0   Carrots  vegetables         8     270
1  Broccoli  vegetables         5     239
2    Banana      fruits         3     617
3     Beans  vegetables         4     384
4    Orange      fruits         5     626
5  Broccoli  vegetables         9     610
6    Banana      fruits        11      62

In [51]:
# Get the total sales of each products

pivot = df.pivot_table(index=['products'],
                       values=['Amount'],
                       aggfunc=['sum'])
print(pivot)

            sum
         Amount
products
Banana      679
Beans       384
Broccoli    849
Carrots     270
Orange      626

In [52]:
#Get the total sales of each category
pivot = df.pivot_table(index=['Category'],
                       values=['Amount'],
                       aggfunc=['sum'])
print(pivot)

              sum
           Amount
Category
fruits       1305
vegetables   1503

In [56]:
#get the total sales of category and products both

pivot = df.pivot_table(index=['products','Category'],
                       values=['Amount'],
                       aggfunc=['sum'])
print(pivot)

                       sum
                    Amount
products Category
Banana   fruits        679
Beans    vegetables    384
Broccoli vegetables    849
Carrots  vegetables    270
Orange   fruits        626

In [58]:
#get the mean,median,minimum sale by category

pivot = df.pivot_table(index=['Category'],
                       values=['Amount'],
                       aggfunc=['median','mean','min'])
print(pivot)

           median    mean    min
           Amount  Amount Amount
Category
fruits        617  435.00     62
vegetables    327  375.75    239

In [ ]:
# Q7 : Write a Pandas program to detect missing values of a DataFrame. Display True or False

In [64]:
import pandas as pd
import numpy as np

pd.set_option('display.max_rows', None)
df = pd.DataFrame({'order_no':[7001,np.nan,7002,7004,np.nan,7005,np.nan,70010,7003,70012,np.nan,70013],
                   'purchase_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
                   'order_date':['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
                   'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
                   'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})
print("Original Orders DataFrame:")
print(df)
print("---------------------------------------------------------------")
print("\nMissing values of the said dataframe:")
print(df.isna())

Original Orders DataFrame:
    order_no  purchase_amt  order_date  customer_id  salesman_id
0     7001.0        150.50  2012-10-05         3002       5002.0
1        NaN        270.65  2012-09-10         3001       5003.0
2     7002.0         65.26         NaN         3001       5001.0
3     7004.0        110.50  2012-08-17         3003          NaN
4        NaN        948.50  2012-09-10         3002       5002.0
5     7005.0       2400.60  2012-07-27         3001       5001.0
6        NaN       5760.00  2012-09-10         3001       5001.0
7    70010.0       1983.43  2012-10-10         3004          NaN
8     7003.0       2480.40  2012-10-10         3003       5003.0
9    70012.0        250.45  2012-06-27         3002       5002.0
10       NaN         75.29  2012-08-17         3001       5003.0
11   70013.0       3045.60  2012-04-25         3001          NaN
---------------------------------------------------------------

Missing values of the said dataframe:
    order_no  purchase_amt  order_date  customer_id  salesman_id
0      False         False       False        False        False
1       True         False       False        False        False
2      False         False        True        False        False
3      False         False       False        False         True
4       True         False       False        False        False
5      False         False       False        False        False
6       True         False       False        False        False
7      False         False       False        False         True
8      False         False       False        False        False
9      False         False       False        False        False
10      True         False       False        False        False
11     False         False       False        False         True

In [65]:
# Q8 : Write a Pandas program to count the number of missing values in each column

In [66]:
#Q9 : Write a Python program to find the maximum and minimum value of array

In [68]:

NumList = []
Number = int(input("How many element in list, Please enter num :- "))
for i in range(1, Number + 1):
    value = int(input("Please enter the Value of %d Element : " %i))
    NumList.append(value)
 
smallest = largest = NumList[0]
 
for j in range(1, Number):
    if(smallest > NumList[j]):
        smallest = NumList[j]
        min_position = j
    if(largest < NumList[j]):
        largest = NumList[j]
        max_position = j
 
print("The Smallest Element in this List is : ", smallest)
print("The Index position of Smallest Element in this List is : ", min_position)
 
print("The Largest Element in this List is : ", largest)
print("The Index position of Largest Element in this List is : ", max_position)

How many element in list, Please enter num :- 5
Please enter the Value of 1 Element : 70
Please enter the Value of 2 Element : 90
Please enter the Value of 3 Element : 60
Please enter the Value of 4 Element : 80
Please enter the Value of 5 Element : 45
The Smallest Element in this List is :  45
The Index position of Smallest Element in this List is :  4
The Largest Element in this List is :  90
The Index position of Largest Element in this List is :  1

In [ ]:
# Q10 : Write a NumPy program to repeat all the elements three times of a given array of string['Pie' ,'pigeon' ,'Joker' ,'Cake']

In [70]:
import numpy as np
x1 = np.array(['pie','pigeon','joker','cake'],dtype=np.str)
print('Original array')
print(x1)

new_array = np.char.multiply(x1,3)
print('New Array')
print(new_array)

Original array
['pie' 'pigeon' 'joker' 'cake']
New Array
['piepiepie' 'pigeonpigeonpigeon' 'jokerjokerjoker' 'cakecakecake']

<ipython-input-70-416d86f7b056>:2: DeprecationWarning: `np.str` is a deprecated alias for the builtin `str`. To silence this warning, use `str` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.str_` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  x1 = np.array(['pie','pigeon','joker','cake'],dtype=np.str)